data/2018-03-12-express-fasthttprouter/report-express-3000.txt
Requests      [total, rate]            30000, 2999.67
Duration      [total, attack, wait]    20.4553098s, 10.0010895s, 10.4542203s
Latencies     [mean, 50, 95, 99, max]  1.699960402s, 1.5089989s, 4.009012521s, 9.6350007s, 19.4463276s
Bytes In      [total, mean]            2480670, 82.69
Bytes Out     [total, mean]            0, 0.00
Success       [ratio]                  91.88%
Status Codes  [code:count]             200:27563  0:2437  
Error Set:
Get http://box.ckcks12.com:3000: dial tcp 0.0.0.0:0->45.77.21.205:3000: bind: An operation on a socket could not be performed because the system lacked sufficient buffer space or because a queue was full.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:9369->45.77.21.205:3000: wsarecv: An existing connection was forcibly closed by the remote host.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:9373->45.77.21.205:3000: wsarecv: An existing connection was forcibly closed by the remote host.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:9352->45.77.21.205:3000: wsarecv: An existing connection was forcibly closed by the remote host.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:9365->45.77.21.205:3000: wsarecv: An existing connection was forcibly closed by the remote host.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:9839->45.77.21.205:3000: wsarecv: An existing connection was forcibly closed by the remote host.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:9828->45.77.21.205:3000: wsarecv: An existing connection was forcibly closed by the remote host.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:9836->45.77.21.205:3000: wsarecv: An existing connection was forcibly closed by the remote host.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:9849->45.77.21.205:3000: wsarecv: An existing connection was forcibly closed by the remote host.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:9854->45.77.21.205:3000: wsarecv: An existing connection was forcibly closed by the remote host.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:9844->45.77.21.205:3000: wsarecv: An existing connection was forcibly closed by the remote host.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:10936->45.77.21.205:3000: wsarecv: An existing connection was forcibly closed by the remote host.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:11033->45.77.21.205:3000: wsarecv: An existing connection was forcibly closed by the remote host.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:11049->45.77.21.205:3000: wsarecv: An existing connection was forcibly closed by the remote host.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:11037->45.77.21.205:3000: wsarecv: An existing connection was forcibly closed by the remote host.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:11047->45.77.21.205:3000: wsarecv: An existing connection was forcibly closed by the remote host.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:11032->45.77.21.205:3000: wsarecv: An existing connection was forcibly closed by the remote host.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:11040->45.77.21.205:3000: wsarecv: An existing connection was forcibly closed by the remote host.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:11041->45.77.21.205:3000: wsarecv: An existing connection was forcibly closed by the remote host.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:11031->45.77.21.205:3000: wsarecv: An existing connection was forcibly closed by the remote host.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:11036->45.77.21.205:3000: wsarecv: An existing connection was forcibly closed by the remote host.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:11055->45.77.21.205:3000: wsarecv: An existing connection was forcibly closed by the remote host.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:11739->45.77.21.205:3000: wsarecv: An existing connection was forcibly closed by the remote host.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:11745->45.77.21.205:3000: wsarecv: An existing connection was forcibly closed by the remote host.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:11758->45.77.21.205:3000: wsarecv: An existing connection was forcibly closed by the remote host.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:11761->45.77.21.205:3000: wsarecv: An existing connection was forcibly closed by the remote host.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:11756->45.77.21.205:3000: wsarecv: An existing connection was forcibly closed by the remote host.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:11770->45.77.21.205:3000: wsarecv: An existing connection was forcibly closed by the remote host.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:11774->45.77.21.205:3000: wsarecv: An existing connection was forcibly closed by the remote host.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:11747->45.77.21.205:3000: wsarecv: An existing connection was forcibly closed by the remote host.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:11776->45.77.21.205:3000: wsarecv: An existing connection was forcibly closed by the remote host.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:11767->45.77.21.205:3000: wsarecv: An existing connection was forcibly closed by the remote host.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:11772->45.77.21.205:3000: wsarecv: An existing connection was forcibly closed by the remote host.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:11769->45.77.21.205:3000: wsarecv: An existing connection was forcibly closed by the remote host.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:11775->45.77.21.205:3000: wsarecv: An existing connection was forcibly closed by the remote host.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:11785->45.77.21.205:3000: wsarecv: An existing connection was forcibly closed by the remote host.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:11779->45.77.21.205:3000: wsarecv: An existing connection was forcibly closed by the remote host.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:11786->45.77.21.205:3000: wsarecv: An existing connection was forcibly closed by the remote host.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:11788->45.77.21.205:3000: wsarecv: An existing connection was forcibly closed by the remote host.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:11780->45.77.21.205:3000: wsarecv: An existing connection was forcibly closed by the remote host.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:11778->45.77.21.205:3000: wsarecv: An existing connection was forcibly closed by the remote host.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:11787->45.77.21.205:3000: wsarecv: An existing connection was forcibly closed by the remote host.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:11782->45.77.21.205:3000: wsarecv: An existing connection was forcibly closed by the remote host.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:11784->45.77.21.205:3000: wsarecv: An existing connection was forcibly closed by the remote host.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:11801->45.77.21.205:3000: wsarecv: An existing connection was forcibly closed by the remote host.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:7086->45.77.21.205:3000: wsarecv: A connection attempt failed because the connected party did not properly respond after a period of time, or established connection failed because connected host has failed to respond.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:7075->45.77.21.205:3000: wsarecv: A connection attempt failed because the connected party did not properly respond after a period of time, or established connection failed because connected host has failed to respond.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:7071->45.77.21.205:3000: wsarecv: A connection attempt failed because the connected party did not properly respond after a period of time, or established connection failed because connected host has failed to respond.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:8495->45.77.21.205:3000: wsarecv: A connection attempt failed because the connected party did not properly respond after a period of time, or established connection failed because connected host has failed to respond.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:8507->45.77.21.205:3000: wsarecv: A connection attempt failed because the connected party did not properly respond after a period of time, or established connection failed because connected host has failed to respond.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:9336->45.77.21.205:3000: wsarecv: A connection attempt failed because the connected party did not properly respond after a period of time, or established connection failed because connected host has failed to respond.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:9333->45.77.21.205:3000: wsarecv: A connection attempt failed because the connected party did not properly respond after a period of time, or established connection failed because connected host has failed to respond.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:9377->45.77.21.205:3000: wsarecv: A connection attempt failed because the connected party did not properly respond after a period of time, or established connection failed because connected host has failed to respond.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:9350->45.77.21.205:3000: wsarecv: A connection attempt failed because the connected party did not properly respond after a period of time, or established connection failed because connected host has failed to respond.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:9361->45.77.21.205:3000: wsarecv: A connection attempt failed because the connected party did not properly respond after a period of time, or established connection failed because connected host has failed to respond.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:9376->45.77.21.205:3000: wsarecv: A connection attempt failed because the connected party did not properly respond after a period of time, or established connection failed because connected host has failed to respond.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:9374->45.77.21.205:3000: wsarecv: A connection attempt failed because the connected party did not properly respond after a period of time, or established connection failed because connected host has failed to respond.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:9358->45.77.21.205:3000: wsarecv: A connection attempt failed because the connected party did not properly respond after a period of time, or established connection failed because connected host has failed to respond.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:9372->45.77.21.205:3000: wsarecv: A connection attempt failed because the connected party did not properly respond after a period of time, or established connection failed because connected host has failed to respond.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:9386->45.77.21.205:3000: wsarecv: A connection attempt failed because the connected party did not properly respond after a period of time, or established connection failed because connected host has failed to respond.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:9383->45.77.21.205:3000: wsarecv: A connection attempt failed because the connected party did not properly respond after a period of time, or established connection failed because connected host has failed to respond.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:9359->45.77.21.205:3000: wsarecv: A connection attempt failed because the connected party did not properly respond after a period of time, or established connection failed because connected host has failed to respond.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:9351->45.77.21.205:3000: wsarecv: A connection attempt failed because the connected party did not properly respond after a period of time, or established connection failed because connected host has failed to respond.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:9367->45.77.21.205:3000: wsarecv: A connection attempt failed because the connected party did not properly respond after a period of time, or established connection failed because connected host has failed to respond.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:9366->45.77.21.205:3000: wsarecv: A connection attempt failed because the connected party did not properly respond after a period of time, or established connection failed because connected host has failed to respond.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:9354->45.77.21.205:3000: wsarecv: A connection attempt failed because the connected party did not properly respond after a period of time, or established connection failed because connected host has failed to respond.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:9370->45.77.21.205:3000: wsarecv: A connection attempt failed because the connected party did not properly respond after a period of time, or established connection failed because connected host has failed to respond.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:9368->45.77.21.205:3000: wsarecv: A connection attempt failed because the connected party did not properly respond after a period of time, or established connection failed because connected host has failed to respond.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:9371->45.77.21.205:3000: wsarecv: A connection attempt failed because the connected party did not properly respond after a period of time, or established connection failed because connected host has failed to respond.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:9348->45.77.21.205:3000: wsarecv: A connection attempt failed because the connected party did not properly respond after a period of time, or established connection failed because connected host has failed to respond.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:9363->45.77.21.205:3000: wsarecv: A connection attempt failed because the connected party did not properly respond after a period of time, or established connection failed because connected host has failed to respond.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:9362->45.77.21.205:3000: wsarecv: A connection attempt failed because the connected party did not properly respond after a period of time, or established connection failed because connected host has failed to respond.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:9349->45.77.21.205:3000: wsarecv: A connection attempt failed because the connected party did not properly respond after a period of time, or established connection failed because connected host has failed to respond.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:9819->45.77.21.205:3000: wsarecv: A connection attempt failed because the connected party did not properly respond after a period of time, or established connection failed because connected host has failed to respond.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:9827->45.77.21.205:3000: wsarecv: A connection attempt failed because the connected party did not properly respond after a period of time, or established connection failed because connected host has failed to respond.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:9805->45.77.21.205:3000: wsarecv: A connection attempt failed because the connected party did not properly respond after a period of time, or established connection failed because connected host has failed to respond.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:9837->45.77.21.205:3000: wsarecv: A connection attempt failed because the connected party did not properly respond after a period of time, or established connection failed because connected host has failed to respond.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:9848->45.77.21.205:3000: wsarecv: A connection attempt failed because the connected party did not properly respond after a period of time, or established connection failed because connected host has failed to respond.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:9850->45.77.21.205:3000: wsarecv: A connection attempt failed because the connected party did not properly respond after a period of time, or established connection failed because connected host has failed to respond.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:9832->45.77.21.205:3000: wsarecv: A connection attempt failed because the connected party did not properly respond after a period of time, or established connection failed because connected host has failed to respond.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:9842->45.77.21.205:3000: wsarecv: A connection attempt failed because the connected party did not properly respond after a period of time, or established connection failed because connected host has failed to respond.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:9851->45.77.21.205:3000: wsarecv: A connection attempt failed because the connected party did not properly respond after a period of time, or established connection failed because connected host has failed to respond.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:9846->45.77.21.205:3000: wsarecv: A connection attempt failed because the connected party did not properly respond after a period of time, or established connection failed because connected host has failed to respond.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:9816->45.77.21.205:3000: wsarecv: A connection attempt failed because the connected party did not properly respond after a period of time, or established connection failed because connected host has failed to respond.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:9847->45.77.21.205:3000: wsarecv: A connection attempt failed because the connected party did not properly respond after a period of time, or established connection failed because connected host has failed to respond.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:9845->45.77.21.205:3000: wsarecv: A connection attempt failed because the connected party did not properly respond after a period of time, or established connection failed because connected host has failed to respond.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:9853->45.77.21.205:3000: wsarecv: A connection attempt failed because the connected party did not properly respond after a period of time, or established connection failed because connected host has failed to respond.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:9840->45.77.21.205:3000: wsarecv: A connection attempt failed because the connected party did not properly respond after a period of time, or established connection failed because connected host has failed to respond.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:9841->45.77.21.205:3000: wsarecv: A connection attempt failed because the connected party did not properly respond after a period of time, or established connection failed because connected host has failed to respond.
Get http://box.ckcks12.com:3000: read tcp 121.140.51.109:9843->45.77.21.205:3000: wsarecv: A connection attempt failed because the connected party did not properly respond after a period of time, or established connection failed because connected host has failed to respond.